'''
1.面向对象：(思想)

面向：看、关注、瞅

对象：个体、实体、实例、结果单词：object在python中一些皆对象

面向过程：(思想)

面向：看、关注、瞅

过程：经过、经历、从头到尾

使用一些生活中的案例来对面向过程和面向对象进行区分比较：

案例一：

使用面向过程的思想解决吃饭的问题？

1.考虑今天吃什么？

2.去菜场买菜

3.挑菜(货比三家、针对性砍价)

4.结账走人

5.摘菜

6.洗菜

7.切菜

8.炒菜

9.焖饭

10.吃饭

11.洗刷

使用面向对象的思想解决吃饭的问题？

1.考虑今天吃什么？

2.去饭店

1).调用服务员的点菜功能

2).将点菜的信息给到厨师

3).厨师调用服务员的上菜功能

3.开始吃饭

4.结账走人(方式很多)

案例二：

使用面向过程的思想解决买电脑的问题？(组装电脑)

1.上网查阅一些参数

2.去电脑城(路上会遇到一些发传单小gg、小mm)

3.挑选配件(货比三家)

4.回家整理下

5.再次去电脑城顶配置

6.安装硬件(监工)

7.安装系统软件和应用软件

8.自己扛电脑回家，开始LOL

使用面向对象的思想解决买电脑的问题？(组装电脑)

1.找一个懂电脑的老手(比如老郭)，将需求告知他

2.把钱给到老郭，坐等老郭凯旋回来

3.老家将电脑扛回你家，一起LOL

面试题：

请谈一谈你对面向对象思想的理解？(逗比版)

....

面向过程：

从头到尾全部参与(参与者)，这程序中的体现主要是定义模块、定义类、定义函数，以及定义其它的成员

面向对象：

先不急着去定义任何内容，找一找有没有现有的对象存在(找对象、指挥者)

1.如果有对象，那么就调用此对象的函数或者属性完成需求

2.如果没有对象，那么先创建对象，然后在调用对象的功能或者属性完成需求

3.如果没有对象也没有类，那么就先设计类，然后在创建对象，在完成需求

总结：在之后的学习和开发过程中，面向对象和面向过程是都会用到的
'''